Repository: BravoBaldo/Translations
Catalog: LVGL/LVGL_TradIta/LVGL_TradIta-omegat.tmx
Source language: en_us
Languages: it_it

source: Use `misc/lv_templ.c <https://github.com/lvgl/lvgl/blob/master/src/misc/lv_templ.c>`__ and `misc/lv_templ.h <https://github.com/lvgl/lvgl/blob/master/src/misc/lv_templ.h>`__
it_it: Usare `misc/lv_templ.c <https://github.com/lvgl/lvgl/blob/master/src/misc/lv_templ.c>`__ e `misc/lv_templ.h <https://github.com/lvgl/lvgl/blob/master/src/misc/lv_templ.h>`__

source: Use a bitmap font to draw Emojis using FreeType
it_it: Utilizzare un font bitmap per disegnare Emoji con FreeType

source: Use a more convenient IDE, such as Visual-Studio-based simulation projects.
it_it: Utilizzare un IDE più pratico, come i progetti di simulazione basati su Visual Studio.

source: Use back-quotes (\`...\`) around code elements (variables, type names, function names).
it_it: Utilizzare le virgolette inverse (\`...\`) attorno agli elementi del codice (variabili, nomi di tipo, nomi di funzione).

source: Use direct-mode plus dual buffer even on ESP32 that does not have built-in display controller.
it_it: Utilizzare la modalità diretta con doppio buffer anche su ESP32 che non dispone di un controller del display integrato.

source: Use emojis in a text.
it_it: Utilizzare emoji in un testo.

source: Use equirectangular (360°) panoramic images in HDR or JPEG format
it_it: Utilizzare immagini panoramiche equirettangolare (360°) in formato HDR o JPEG

source: Use function :cpp:expr:`lv_spangroup_set_align(spangroup, LV_TEXT_ALIGN_...)` to set text alignment.
it_it: Usare la funzione :cpp:expr:`lv_spangroup_set_align(spangroup, LV_TEXT_ALIGN_...)` per impostare l'allineamento del testo.

source: Use it by name in text:
it_it: Usarlo per nome nel testo:

source: Use lvgl online tool https://lvgl.io/tools/imageconverter
it_it: Utilizzare lo strumento online di lvgl https://lvgl.io/tools/imageconverter

source: Use of MUTEXes requires:
it_it: L'utilizzo dei MUTEX richiede:

source: Use of buffers at least 1/10 display size is recommended.
it_it: Si consiglia l'utilizzo di buffer di dimensioni pari ad almeno 1/10 delle dimensioni del display.

source: Use of the Wayland driver is supported on boards with a Wayland desktop AKA a Wayland compositor.
it_it: L'utilizzo del driver Wayland è supportato sulle schede madri con un desktop Wayland, ovvero un compositore Wayland.

source: Use paradigms such as Object-Oriented Programming.
it_it: Utilizzo di paradigmi come la Programmazione Object-Oriented.

source: Use proper grammar for clarity.
it_it: Utilizzare una grammatica corretta per chiarezza.

source: Use the :cpp:func:`lv_freetype_font_create` function to create a font.
it_it: Utilizzare la funzione :cpp:func:`lv_freetype_font_create` per creare un font.

source: Use the :cpp:expr: Interpreted Text Role for more complex expressions, for example when showing the arguments passed to a function.
it_it: Utilizzare lo "Interpreted Text Role" :cpp:expr: per espressioni più complesse, ad esempio quando si visualizzano gli argomenti passati a una funzione.

source: Use the Editor's export code functionality to generate C code, which E2Studio will automatically detect and include in its build.
it_it: Utilizzare la funzionalità di esportazione del codice dell'Editor per generare codice C, che E2Studio rileverà automaticamente e includerà nella sua build.

source: Use the LVGL XML loader freely in accordance with its MIT license.
it_it: Utilizzare liberamente il loader XML LVGL in conformità con la sua licenza MIT.

source: Use the Specification with the **LVGL UI editor** and **official LVGL tools such as the CLI or XML loader**.
it_it: Utilizzare la Specifica con l'**editor UI LVGL** e gli **strumenti LVGL ufficiali come la CLI o il loader XML**.

source: Use the `Offline font converter <https://github.com/lvgl/lv_font_conv>`__.
it_it: Utilizzo del `Convertitore di font offline <https://github.com/lvgl/lv_font_conv>`__.

source: Use the examples and demos
it_it: Usare gli esempi e le demo

source: Use the first touch point from the touch driver in the first indev, and use the second point in the second indev.
it_it: Utilizzare il primo punto di tocco dal driver touch nel primo indev e il secondo punto nel secondo indev.

source: Use the following Interpreted Text Roles in text to include in-line C code that links to documentation on that symbol when available:
it_it: Utilizzare i seguenti "Interpreted Text Roles" nel testo per includere codice C in-line che rimanda alla documentazione relativa a quel simbolo, quando disponibile:

source: Use the following functions to set and control the Flex layout on any parent Widget.
it_it: Si usano le seguenti funzioni per impostare e controllare il layout Flex su qualsiasi Widget genitore.

source: Use the font like ``lv_style_set_text_font(&my_style, &font_name);`` or ``lv_obj_set_style_text_font(label1, &font_name, 0);``
it_it: Usare il font come ``lv_style_set_text_font(&my_style, &font_name);`` o ``lv_obj_set_style_text_font(label1, &font_name, 0);``

source: Use the format according to your needs: a fully opaque image, or one using an alpha channel.
it_it: Utilizzare il formato in base alle proprie esigenze: un'immagine completamente opaca o un'immagine che utilizza un canale alfa.

source: Use the mouse to move the focus and click on functions on the timeline to observe their execution time.
it_it: Utilizzare il mouse per spostare il focus e cliccare sulle funzioni sulla timeline per osservarne il tempo di esecuzione.

source: Use the online- or offline converter to convert the file to an :cpp:type:`lv_image_dsc_t` object + data into a ``.c`` file and compile and link it into your project.
it_it: Utilizzare il convertitore online o offline per convertire il file in un oggetto :cpp:type:`lv_image_dsc_t` + dati in un file ``.c``, poi compilaelo e linkarlo al progetto.

source: Use the smallest required scope.
it_it: Utilizzare lo scope più piccolo richiesto.

source: Use them to set limits when using ``LV_SIZE_CONTENT`` or percentage sizes:
it_it: Utilizzarli per impostare limiti quando si utilizzano ``LV_SIZE_CONTENT`` o dimensioni percentuali:

source: Use these conventions for section headings in LVGL documentation:
it_it: Utilizzare queste convenzioni per le intestazioni delle sezioni nella documentazione LVGL:

source: Use this Specification in **any firmware or embedded application** built on top of the official `LVGL library <https://github.com/lvgl/lvgl>`_ (MIT-licensed).
it_it: Utilizzare questa Specifica in **qualsiasi firmware o applicazione embedded** basata sulla `libreria ufficiale LVGL <https://github.com/lvgl/lvgl>`_ (MIT-licensed).

source: Use this Specification into general-purpose design tools or frameworks outside the LVGL ecosystem.
it_it: Utilizzare questa Specifica in strumenti o framework di progettazione generici al di fuori dell'ecosistema LVGL.

source: Use this to check which multi-touch gesture is currently reported.
it_it: Usare questa funzione per verificare quale gesto multi-touch è attualmente segnalato.

source: Use two display buffers and flush the buffer with DMA (or similar peripheral) in the background.
it_it: Utilizzare due buffer di visualizzazione e svuotare il buffer con DMA (o una periferica simile) in background.

source: Use typed pointers instead of :cpp:expr:`void *` pointers
it_it: Utilizzare puntatori tipizzati invece di puntatori :cpp:expr:`void *`

source: Use:
it_it: Utilizzo:

source: Used by the layouts.
it_it: Utilizzato dai layout.

source: Used for indexed access, like setting values in a table:
it_it: Utilizzata per l'accesso indicizzato, come l'impostazione di valori in una tabella:

source: Used for internal/implicit elements:
it_it: Utilizzata per elementi interni/impliciti:

source: Used in a view:
it_it: Utilizzata in una vista:

source: Used only if `grad_dir` is not `LV_GRAD_DIR_NONE`
it_it: Utilizzato solo se `grad_dir` non è `LV_GRAD_DIR_NONE`

source: Used to describe any custom API functions with a custom name.
it_it: Utilizzata per descrivere qualsiasi funzione API personalizzata con un nome personalizzato.

source: Used when the number of elements is not known or delivered via another mechanism, such as via another setting.
it_it: Utilizzata quando il numero di elementi non è noto o è fornito tramite un altro meccanismo, ad esempio tramite un'altra impostazione.

source: Useful Style Properties for Sections
it_it: Proprietà di Stile utili per le Sezioni

source: Useful for hover or press effects.
it_it: Utile per gli effetti del passaggio o della pressione del mouse.

source: Useful for visual debugging.
it_it: Utile per il debug visivo.

source: Useful if the Widget size is smaller than the image source size.
it_it: Utile se le dimensioni del Widget sono inferiori a quelle dell'immagine sorgente.

source: Useful with OSes that host a user-accessible Work Queue
it_it: Utile con i sistemi operativi che ospitano una "Work Queue" accessibile all'utente

source: User Data
it_it: Dati Utente

source: User Interface
it_it: Interfaccia Utente

source: User code developed under simulator can be shared with firmware to make UI development more efficient.
it_it: Il codice utente sviluppato tramite simulatore può essere condiviso con il firmware per rendere più efficiente lo sviluppo dell'interfaccia utente.

source: User-defined functions can be called like this:
it_it: Le funzioni definite dall'utente possono essere chiamate in questo modo:

source: Users can add their own measured functions:
it_it: Gli utenti possono aggiungere le proprie funzioni misurate:

source: Uses Kconfig as the configuration system.
it_it: Utilizza Kconfig come sistema di configurazione.

source: Uses ``lv_conf.h`` as the configuration system.
it_it: Usa ``lv_conf.h`` come sistema di configurazione.

source: Uses the :ref:`typical background <typical bg props>` and line style properties (for division lines).
it_it: Utilizza le proprietà :ref:`tipiche del background <typical bg props>` e stile della linea (per le linee di divisione).

source: Uses the :ref:`typical background style properties <typical bg props>`
it_it: Utilizza le :ref:`tipiche proprietà di stile del background <typical bg props>`

source: Uses the :ref:`typical background style properties <typical bg props>`.
it_it: Utilizza le :ref:`tipiche proprietà di stile del background <typical bg props>`.

source: Using :c:macro:`LV_STDLIB_CLIB` for :c:macro:`LV_USE_STDLIB_MALLOC`, :c:macro:`LV_USE_STDLIB_STRING`, or :c:macro:`LV_USE_STDLIB_SPRINTF` is reasonable as NuttX fully implements these standard library APIs.
it_it: Utilizzare :c:macro:`LV_STDLIB_CLIB` per :c:macro:`LV_USE_STDLIB_MALLOC`, :c:macro:`LV_USE_STDLIB_STRING` o :c:macro:`LV_USE_STDLIB_SPRINTF` è ragionevole, poiché NuttX implementa completamente queste API della libreria standard.

source: Using :cpp:func:`lv_obj_add_style`:
it_it: Uso di :cpp:func:`lv_obj_add_style`:

source: Using :cpp:func:`lv_obj_replace_style`:
it_it: Uso di :cpp:func:`lv_obj_replace_style`:

source: Using Components in XML is very intuitive.
it_it: L'utilizzo dei Componenti in XML è molto intuitivo.

source: Using Custom Image Formats
it_it: Utilizzo di Formati Immagine Personalizzati

source: Using DRM with EGL
it_it: Utilizzo di DRM con EGL

source: Using DRM with GBM
it_it: Utilizzo di DRM con GBM

source: Using EGL requires some additional platform integration.
it_it: L'utilizzo di EGL richiede un'ulteriore integrazione con la piattaforma.

source: Using Font Fallback
it_it: Utilizzo del Font Fallback

source: Using GIF Images from Files
it_it: Utilizzo di Immagini GIF da File

source: Using Images
it_it: Utilizzo delle immagini

source: Using LVGL in Your ESP-IDF Project
it_it: Utilizzo di LVGL nel proprio progetto ESP-IDF

source: Using LVGL in a firmware project effectively reduces the GUI-developer's job to defining the GUI and furnishing it with appropriate event hooks to carry out the valuable work of the GUI.
it_it: L'utilizzo di LVGL in un progetto firmware riduce efficacemente il lavoro dello sviluppatore della GUI alla sua definizione e alla fornitura di hook di eventi appropriati per svolgere il prezioso lavoro della GUI.

source: Using LVGL with STM32 HAL
it_it: Utilizzo di LVGL con STM32 HAL

source: Using LVGL, Linux and NuttX you can reduce this process and just test everything on your computer and when it is done, compile it on NuttX and that is it.
it_it: Utilizzando LVGL, Linux e NuttX si può ridurre questo processo e testare tutto sul computer e, una volta completato, compilarlo su NuttX e il gioco è fatto.

source: Using Logging
it_it: Utilizzo del Logging

source: Using MIT-licensed code
it_it: Utilizzo di codice con licenza MIT

source: Using MicroPython, you can write Python3 code and run it even on a bare metal architecture with limited resources.
it_it: Utilizzando MicroPython, è possibile scrivere codice Python3 ed eseguirlo anche su un'architettura "bare-metal" con risorse limitate.

source: Using Observer first requires :c:macro:`LV_USE_OBSERVER` be configured to ``1``.
it_it: Per utilizzare l'Observer, è necessario che :c:macro:`LV_USE_OBSERVER` sia configurato a ``1``.

source: Using Online Share with public repositories is very simple: just paste the URL to the repository and hit the "Load Project" button.
it_it: Utilizzare Online Share con i repository pubblici è molto semplice: basta incollare l'URL del repository e premere il pulsante "Load Project".

source: Using XML instead of pure drag-and-drop editing has several advantages:
it_it: Utilizzare XML invece della semplice modifica tramite trascinamento della selezione offre diversi vantaggi:

source: Using Your Custom Symbol
it_it: Utilizzo del Simbolo Custom

source: Using ``lv_conf.h``
it_it: Uso di ``lv_conf.h``

source: Using ``platformio.ini``
it_it: Uso di ``platformio.ini``

source: Using a Specific Version of LVGL
it_it: Utilizzo di una Versione Specifica di LVGL

source: Using a cache can effectively reduce the number of times the gradient image is created and improve drawing efficiency.
it_it: L'utilizzo di una cache può ridurre efficacemente il numero di volte in cui l'immagine del gradiente viene creata e migliorare l'efficienza del disegno.

source: Using a custom ID generator
it_it: Utilizzo di un generatore di ID personalizzato

source: Using a negative ``step`` will decrement the value instead.
it_it: Utilizzando uno ``step`` negativo, il valore verrà invece diminuito.

source: Using an Existing Buffer
it_it: Utilizzo di un Buffer Esistente

source: Using bash to build packages for the target and for Multilib, PN would be bash and lib64-bash, respectively.
it_it: Utilizzando bash per compilare pacchetti per il target e per Multilib, PN sarebbe rispettivamente bash e lib64-bash.

source: Using code from an online source
it_it: Utilizzo di codice da un sorgente online

source: Using events, it's also possible to modify :ref:`draw tasks` or insert new ones as LVGL renders Widgets.
it_it: Utilizzando gli eventi, è anche possibile modificare le :ref:`draw tasks` o inserirne di nuove come Widget di rendering LVGL.

source: Using global variables adds names to the global namespace and is thus generally not recommended.
it_it: L'utilizzo di variabili globali aggiunge nomi allo spazio dei nomi globale ed è quindi generalmente sconsigliato.

source: Using length and radial offset together allows total control of the tick position.
it_it: L'utilizzo combinato di lunghezza e offset radiale consente il controllo totale della posizione della tacca.

source: Using multiple styles
it_it: Utilizzo di stili multipli

source: Using the :cpp:expr:`lv_tabview_set_tab_bar_position(tabview, LV_DIR_LEFT/RIGHT/TOP/BOTTOM)` the tab bar can be moved to any side.
it_it: Utilizzando la funzione :cpp:expr:`lv_tabview_set_tab_bar_position(tabview, LV_DIR_LEFT/RIGHT/TOP/BOTTOM)` la barra delle schede può essere spostata su qualsiasi lato.

source: Using the :ref:`Image decoder interface <image_decoders>`, custom image formats can be supported as well.
it_it: Utilizzando l':ref:`Interfaccia di decodifica delle immagini <image_decoders>`, è possibile supportare anche formati di immagini personalizzati.

source: Using the Editor of |lvglpro| instead of writing XML by hand has several advantages:
it_it: Utilizzare l'Editor di |lvglpro| invece di scrivere XML a mano offre diversi vantaggi:

source: Using the Espressif LVGL component PPA features
it_it: Utilizzo delle funzionalità del PPA del componente LVGL di Espressif

source: Using the Exported C Code
it_it: Utilizzo del codice C esportato

source: Using the Exported C Code on Arduino IDE
it_it: Utilizzo del Codice C Esportato nell'IDE di Arduino

source: Using the Exported Code
it_it: Utilizzo del Codice Esportato

source: Using the File System under ESP-IDF
it_it: Utilizzo del file system in ESP-IDF

source: Using the LVGL PPA draw unit on your ESP-IDF project
it_it: Utilizzo dell'unità di disegno PPA LVGL sul progetto ESP-IDF

source: Using the URI factory (``LV_GSTREAMER_FACTORY_URI_DECODE``), you can specify various URI schemes as media sources:
it_it: Utilizzando la factory URI (``LV_GSTREAMER_FACTORY_URI_DECODE``), è possibile specificare diversi schemi URI come sorgenti multimediali:

source: Using the XML Files
it_it: Utilizzo dei File XML

source: Using the XML files
it_it: Utilizzo dei file XML

source: Using the ``NSH>`` terminal start the LVGL demo:
it_it: Utilizzando il terminale ``NSH>`` avviare la demo LVGL:

source: Using the ``vg_lite.h`` header file, ThorVG re-implements the VG-Lite API, generating the same rendered images as the real VG-Lite GPU hardware.
it_it: Utilizzando il file header ``vg_lite.h``, ThorVG reimplementa l'API VG-Lite, generando le stesse immagini renderizzate dell'hardware GPU VG-Lite reale.

source: Using the following generates links to API documentation that the reader can click directly in the text.
it_it: Utilizzando quanto segue si generano link alla documentazione API su cui il lettore può cliccare direttamente nel testo.

source: Using the inner animation
it_it: Utilizzo dell'animazione interna

source: Using the offset parameter a `Texture atlas <https://en.wikipedia.org/wiki/Texture_atlas>`__ or a "running image" effect can be created by :ref:`Animating <animation>` the x or y offset.
it_it: Utilizzando il parametro offset è possibile creare una `Texture atlas <https://en.wikipedia.org/wiki/Texture_atlas>`__ o un effetto "immagine in movimento" :ref:`Animando <animation>` l'offset x o y.

source: Using these or other drivers, multiple repositories are available to help you get started easily.
it_it: Utilizzando questi o altri driver, sono disponibili diversi repository per iniziare facilmente.

source: Using these symbols is very simple:
it_it: Utilizzare questi simboli è molto semplice:

source: Using this method the buffer(s) always contain the whole display image.
it_it: Con questo metodo, i buffer conterranno sempre l'intera immagine del display.

source: Using this, you can use the :ref:`Animation <animation>` functions, for example, to override the animation values using the :cpp:expr:`lv_anim_set_values(anim, start, end)` or to set a callback on the animation completed event.
it_it: In questo modo, è possibile utilizzare le funzioni :ref:`Animation <animation>`, ad esempio, per sovrascrivere i valori dell'animazione utilizzando :cpp:expr:`lv_anim_set_values(anim, start, end)` o per impostare una callback sull'evento di completamento dell'animazione.

source: Using welcoming and inclusive language
it_it: Utilizzare un linguaggio accogliente e inclusivo

source: Using with the CLI
it_it: Utilizzo con la CLI

source: Usually cliparts, drawings, icons and simple graphics are stored in PNG format, that do not use the whole color space, so it is possible to compress further the image by using 8-bit palette colors, instead of 24/32 bit True color format.
it_it: Di solito clipart, disegni, icone e grafica semplice vengono memorizzati in formato PNG, che non utilizza l'intero spazio colore, quindi, è possibile comprimere ulteriormente l'immagine utilizzando colori della tavolozza a 8 bit, invece del formato True Color a 24/32 bit.

source: Usually needed with monochrome displays to invalidate ``N x 8`` rows or columns in one pass.
it_it: Di solito necessario con i display monocromatici per invalidare ``N x 8`` righe o colonne in un unico passaggio.

source: Usually one would implement a separate set of callbacks for each display.
it_it: In genere si implementa un set separato di callback per ciascun display.

source: Usually the manufacturer of the panel provides some example code with recommended register settings.
it_it: Di solito il produttore del pannello fornisce un codice di esempio con le impostazioni di registro consigliate.

source: Usually when one talks about a MIPI-compatible display, one thinks of a device with a DSI serial interface.
it_it: Di solito, quando si parla di un display compatibile con MIPI, si pensa a un dispositivo con interfaccia seriale DSI.

source: Usually, GUI development for low level RTOS requires multiple iterations to get things right, where each iteration consists of **Change code > Build > Flash > Run**.
it_it: Di solito, lo sviluppo di GUI per RTOS di basso livello richiede più iterazioni per ottenere il risultato desiderato, dove ogni iterazione consiste in **Modifica del codice > Build > Flash > Run**.

source: Usually, GUI development requires multiple iterations to get things right.
it_it: Di solito, lo sviluppo di GUI richiede più iterazioni per ottenere risultati ottimali.

source: Usually, a widget that cannot be pressed (like a :ref:`Slider <lv_slider>`) exits *Edit* mode upon a short click.
it_it: In genere, un widget che non può essere premuto (come uno :ref:`Slider <lv_slider>`) esce dalla modalità *Edit* con un clic breve.

source: Usually, the opacity of the Screen is :cpp:enumerator:`LV_OPA_COVER` to provide a solid background for its children.
it_it: Solitamente, l'opacità dello schermo è :cpp:enumerator:`LV_OPA_COVER` per fornire uno sfondo uniforme per i suoi elementi secondari.

source: VG-Lite GPU Simulator
it_it: Simulatore GPU VG-Lite

source: VG-Lite General GPU
it_it: GPU Generica VG-Lite

source: VG-Lite Simulator
it_it: Simulatore VG-Lite

source: VG-Lite uses two sets of command buffer buffers to render instructions, and utilizing this mechanism well can greatly improve drawing efficiency.
it_it: VG-Lite utilizza due set di buffer di comando per il rendering delle istruzioni e un utilizzo efficace di questo meccanismo può migliorare notevolmente l'efficienza di disegno.

source: VGLite accelerator
it_it: Acceleratore VGLite

source: VGLite assertions will verify the driver API status code and in any error, it can stop the program execution in case the :c:macro:`LV_ASSERT_HANDLER` is set to `while(1);` (Halt by default).
it_it: Le asserzioni VGLite verificheranno il codice di stato dell'API del driver e, in caso di errore, potranno interrompere l'esecuzione del programma nel caso in cui :c:macro:`LV_ASSERT_HANDLER` sia impostato su `while(1);` ("Halt" per default).

source: VGLite draw initialization is done automatically in :cpp:func:`lv_init` once the VGLite is enabled, no user code is required:
it_it: L'inizializzazione del disegno di VGLite viene eseguita automaticamente in :cpp:func:`lv_init` una volta abilitato VGLite, non è richiesto alcun codice utente:

source: VS Code extension
it_it: Estensione VS Code

source: Valid values for ``orientation`` are:
it_it: I valori validi per ``orientation`` sono:

source: Validate XML and limit shown errors.
it_it: Convalida XML e limita gli errori visualizzati.

source: Validate content of the XML files (limit shown errors):
it_it: Validare il contenuto dei file XML (limita gli errori visualizzati):
